app/Http/Controllers/BiodataController.php

    public function createBio(Request $request){

        $user = User::find(auth()->user()->id);
        $validatedDataBio = $request->validate([
                    'user_id' => '',
                    'nisn' => 'required|max:10|min:10',
                    'name' => 'required',
                    'nickname' => 'required',
                    'gender' => 'required',
                    'birthplace' => 'required',
                    'birthday' => 'required',
                    'religion' => 'required',
                    'anak_ke' => 'required',
                    'status_keluarga' => 'required',
                    'jurusan' => 'required',
                    'ppdb_id' => 'required'
                ]);

        $user->bio()->create($validatedDataBio);
        $validatedDataBio['user_id'] = auth()->user()->id;
        $validatedAlamat = $request->validate([
                    'alamat' => 'required',
                    'for' => 'required',
                    'provinsi' => 'required',
                    'kabupaten' => 'required',
                    'kecamatan' => 'required',
                    'kodepos' => 'required',
                ]);

        $bio = Biodata::find(auth()->user()->bio->id);
        $bio->alamat()->create($validatedAlamat);
---
SELECT * FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT * FROM `biodatas` WHERE `biodatas`.`user_id` = 1 and `biodatas`.`user_id` IS not NULL LIMIT 1
INSERT INTO `biodatas` (`nisn`, `name`, `nickname`, `gender`, `birthplace`, `birthday`, `religion`, `anak_ke`, `status_keluarga`, `jurusan`, `ppdb_id`, `user_id`, `updated_at`, `created_at`) VALUES ('9800815645', 'Miruko', 'Miru', 'Laki-laki', 'Padang', '2022-09-03', 'Protestan', '3', 'Anak Kandung', 'IPS', '1', 1, '2022-09-19 03:34:39', '2022-09-19 03:34:39')
INSERT INTO `alamats` (`alamat`, `for`, `provinsi`, `kabupaten`, `kecamatan`, `kodepos`, `reference_id`, `updated_at`, `created_at`) VALUES ('Padang', 'biodata', 'Sumatera Barat', 'Solok Selatan', 'Sangir Balai Janggo', '27777', 1, '2022-09-19 03:34:39', '2022-09-19 03:34:39')

    public function profilBio()
    {
        $address = Alamat::where('reference_id',auth()->user()->bio->id)
                         ->where('for','biodata')
                         ->first();
        return view('dashboard.user.profile.profil_siswa',[
            "title" => "bio",
            "biodata" => Biodata::where('id',auth()->user()->bio->id)->first(),
            "address" => $address,
            "minat" => MinatBakat::where('biodata_id',auth()->user()->bio->id)->first()
        ]);
---
SELECT * FROM `alamats` WHERE `reference_id` = 1 and `for` = 'biodata' LIMIT 1
SELECT * FROM `minat_bakats` WHERE `biodata_id` = 1 LIMIT 1
SELECT * FROM `biodatas` WHERE `id` = 1 LIMIT 1

    public function updateBio(Request $request)
    {
        $validatedDataBio = $request->validate([
            'user_id' => '',
            'nisn' => 'required|max:10|min:10',
            'name' => 'required',
            'nickname' => 'required',
            'gender' => 'required',
            'birthplace' => 'required',
            'birthday' => 'required',
            'religion' => 'required',
            'anak_ke' => 'required',
            'status_keluarga' => 'required',
            'jurusan' => 'required',
            'ppdb_id' => 'required'

        ]);
        $validatedDataBio['user_id'] = auth()->user()->id;
        $validatedAlamat = $request->validate   ([
                'alamat' => 'required',
                'for' => 'required',
                'provinsi' => 'required',
                'kabupaten' => 'required',
                'kecamatan' => 'required',
                'kodepos' => 'required',
        ]);
        Biodata::where('id',auth()->user()->bio->id)
                ->update($validatedDataBio);
---
SELECT * FROM `biodatas` WHERE `biodatas`.`user_id` = 1 and `biodatas`.`user_id` IS not NULL LIMIT 1

    public function updateMinat(Request $request){
        $minat = [
            'hobi' => $request->hobi,
            'bidang_favorit' => $request->bidang_favorit,
            'olahraga' => $request->olahraga,
            'cita_cita' => $request->cita_cita,
        ];
        MinatBakat::where('biodata_id',auth()->user()->bio->id)
                    ->update($minat);
---
UPDATE `minat_bakats` SET `hobi` = 'Bermain Catur', `bidang_favorit` = 'Sejarah', `olahraga` = 'Renang', `cita_cita` = 'Menteri Pendidikan', `minat_bakats`.`updated_at` = '2022-09-19 03:08:57' WHERE `biodata_id` = 1