app/Http/Controllers/DashboardAsalSekolahController.php

SELECT * FROM `asal_sekolahs` WHERE `biodata_id` = 1 LIMIT 1
SELECT * FROM `alamats` WHERE `reference_id` = 1 and `for` = 'asal sekolah' LIMIT 1
---
    public function edit($id)
    {
        try{
        $asek = AsalSekolah::where('biodata_id',auth()->user()->bio->id)->firstOrFail();
        $address = Alamat::where('reference_id',auth()->user()->bio->id)
                         ->where('for','asal sekolah')
                         ->firstOrFail();

UPDATE `asal_sekolahs` SET `name` = 'SMP Minangkabau', `sktb` = '989182/M,KLI/001212', `biodata_id` = 1, `asal_sekolahs`.`updated_at` = '2022-09-19 06:47:23' WHERE `biodata_id` = 1
UPDATE `alamats` SET `alamat` = 'Minangkabau', `for` = 'asal sekolah', `provinsi` = 'Sumatera Barat', `kabupaten` = 'Tanah Datar', `kecamatan` = 'Sungayang', `kodepos` = '27294', `alamats`.`updated_at` = '2022-09-19 06:47:23' WHERE `reference_id` = 1 and `for` = 'asal sekolah'
---
    public function update(Request $request, $id)
    {


        $validatedAsalSekolah = $request->validate([
            'biodata_id' => '',
            'name' => 'required',
            'sktb' => 'required'
        ]);
        $validatedAsalSekolah['biodata_id'] = auth()->user()->bio->id;
        AsalSekolah::where('biodata_id',auth()->user()->bio->id)
                    ->update($validatedAsalSekolah);
        $validatedAlamatASek = $request->validate([
            'alamat' => 'required',
            'for' => 'required',
            'provinsi' => 'required',
            'kabupaten' => 'required',
            'kecamatan' => 'required',
            'kodepos' => 'required'
        ]);
        Alamat::where('reference_id',auth()->user()->bio->id)
               ->where('for','asal sekolah')
               ->update($validatedAlamatASek);