app/Http/Controllers/DashboardController.php

SELECT * FROM `dokumens` WHERE `biodata_id` = 1 LIMIT 1
---
    public function dokumen()
    {
        return view('dashboard.user.administrasi.dokumen',[
            'title' => 'Dokumen',
            'doc' => Dokumen::where('biodata_id',auth()->user()->bio->id)->first()
        ]);

UPDATE `dokumens` SET `akta_lahir` = 'docpict/hCzC5LiYprhe4jprqKC8RK06YtTr279cRON1oIXI.pdf', `biodata_id` = 1, `dokumens`.`updated_at` = '2022-09-18 01:54:59' WHERE `biodata_id` = 1
---
        }


        Dokumen::where('biodata_id',auth()->user()->bio->id)
                ->update($validatedDoc);

SELECT * FROM `users` WHERE `id` = 1 LIMIT 1
---
    public function email_password()
    {
        $user = User::where('id',auth()->user()->id)->first();

UPDATE `users` SET `password` = '$2y$10$dQujgxerDqk56eLSd0gRQeiyQC05hiC1nI8wXO0qbOKU.4ZUCKobq', `users`.`updated_at` = '2022-09-18 16:25:39' WHERE `id` = 1
---
    public function editpassword(Request $request)
    {
        $request->validate([
            'current_password' => 'required',
            'password' => ['required', 'min:8', 'confirmed']
        ]);

        if(Hash::check($request->current_password, auth()->user()->password)){
            User::where('id',auth()->user()->id)
            ->update(['password' => Hash::make($request->password)]);