app/Http/Controllers/DashboardOrangTuaController.php

    public function store(Request $request)
    {
        // dd($request->all());
        $bio = Biodata::find(auth()->user()->bio->id);
        $ayah = [
                'biodata_id'       => $request->biodata_id1,
                'role'             => $request->role1,
                'name'             => $request->name1,
                'birthday'         => $request->birthday1,
                'religion'         => $request->religion1,
                'profession'       => $request->profession1,
                'phone'            => $request->phone1
       ];
        $ibu = [
                'biodata_id'       => $request->biodata_id2,
                'role'             => $request->role2,
                'name'             => $request->name2,
                'birthday'         => $request->birthday2,
                'religion'         => $request->religion2,
                'profession'       => $request->profession2,
                'phone'            => $request->phone2
               ];

        $bio->orangtua()->createMany([$ayah,$ibu]);
        $ortu = DataOrangTua::where('biodata_id',auth()->user()->bio->id)->first();
---
SELECT * FROM `biodatas` WHERE `biodatas`.`user_id` = 2 and `biodatas`.`user_id` IS not NULL LIMIT 1
INSERT INTO `data_orang_tuas` (`biodata_id`, `role`, `name`, `birthday`, `religion`, `profession`, `phone`, `updated_at`, `created_at`) VALUES (5, 'Ayah', 'adwdawd', '2022-09-12', 'Protestan', 'PNS', '19203123031', '2022-09-18 17:14:28', '2022-09-18 17:14:28')
SELECT * FROM `data_orang_tuas` WHERE `biodata_id` = 5 LIMIT 1

                       'provinsi'  => $request->provinsi2,
                       'kodepos'   => $request->kodepos2
                       ];
        $ortu->alamat()->createMany([$alamatAyah,$alamatIbu]);
---
INSERT INTO `alamats` (`alamat`, `for`, `kecamatan`, `kabupaten`, `provinsi`, `kodepos`, `reference_id`, `updated_at`, `created_at`) VALUES ('wadadsadw', 'ayah', 'Cikalong', 'Tasikmalaya', 'Jawa Barat', '46195', 5, '2022-09-18 17:14:28', '2022-09-18 17:14:28')

                 'profession'   => $request->profession3,
                 'phone'        => $request->phone3
                ];
        $bio->walilain()->create($wali);
        $wali = WaliLain::where('biodata_id',auth()->user()->bio->id)->first();
---
INSERT INTO `wali_lains` (`biodata_id`, `role`, `nik`, `name`, `birthplace`, `birthday`, `religion`, `profession`, `updated_at`, `created_at`) VALUES (5, 'Kakak', '2132141231221', 'Lugowo', 'kawkdadw', '2022-09-08', 'protestan', 'Karyawan', '2022-09-18 17:14:28', '2022-09-18 17:14:28')
SELECT * FROM `wali_lains` WHERE `biodata_id` = 5 LIMIT 1

                       'provinsi'  => $request->provinsi3,
                       'kodepos'   => $request->kodepos3
                      ];
        $wali->alamat()->create($alamatWali);
---
INSERT INTO `alamats` (`alamat`, `for`, `kecamatan`, `kabupaten`, `provinsi`, `kodepos`, `reference_id`, `updated_at`, `created_at`) VALUES ('adwdasdw', 'wali', 'Balapulang', 'Tegal', 'Jawa Barat', '12314', 5, '2022-09-18 17:14:28', '2022-09-18 17:14:28')

    public function edit()
    {
        try{
        $ayah = DataOrangTua::where('biodata_id',auth()->user()->bio->id)
                            ->where('role','ayah')
                            ->firstOrFail();
        $ibu = DataOrangTua::where('biodata_id',auth()->user()->bio->id)
                            ->where('role','ibu')
                            ->firstOrFail();
        $wali = WaliLain::where('biodata_id',auth()->user()->bio->id)
                        ->firstOrFail();
        $alamatAyah = Alamat::where([['reference_id',auth()->user()->bio->id],['for','ayah']])
                            ->first();
        $alamatIbu = Alamat::where([['reference_id',auth()->user()->bio->id],['for','ibu']])
                            ->first();
        $alamatWali = Alamat::where([['reference_id',auth()->user()->bio->id],['for','wali']])
                            ->first();
---
SELECT * FROM `data_orang_tuas` WHERE `biodata_id` = 5 and `role` = 'ayah' LIMIT 1
SELECT * FROM `data_orang_tuas` WHERE `biodata_id` = 1 and `role` in ('ibu', 'ayah')
SELECT * FROM `wali_lains` WHERE `biodata_id` = 5 LIMIT 1
SELECT * FROM `alamats` WHERE `alamats`.`reference_id` in (1) and `alamats`.`role` in ('ayah', 'ibu')
SELECT * FROM `alamats` WHERE (`reference_id` = 5 and `for` = 'ibu') LIMIT 1
SELECT * FROM `alamats` WHERE (`reference_id` = 5 and `for` = 'wali') LIMIT 1

                'provinsi'  => $request->provinsi2,
                'kodepos'   => $request->kodepos2
                ];
        DataOrangTua::where('biodata_id',auth()->user()->bio->id)
                    ->where('role','ayah')
                    ->update($ayah);
        DataOrangTua::where('biodata_id',auth()->user()->bio->id)
                    ->where('role','ibu')
                    ->update($ibu);
        Alamat::where('reference_id',auth()->user()->bio->id)
                ->where('for','ayah')
                ->update($alamatAyah);
---
UPDATE `data_orang_tuas` SET `biodata_id` = 1, `role` = 'ibu', `name` = 'Nio', `birthday` = '2311-01-10', `religion` = 'Konghucu', `profession` = 'Karyawan', `phone` = '087866554658', `data_orang_tuas`.`updated_at` = '2022-09-18 16:23:37' WHERE `biodata_id` = 1 and `role` = 'ibu'
UPDATE `alamats` SET `alamat` = 'awdasdawd', `for` = 'ibu', `kecamatan` = 'Gunung Labuhan', `kabupaten` = 'Way Kanan', `provinsi` = 'Lampung', `kodepos` = '34768', `alamats`.`updated_at` = '2022-09-18 16:23:37' WHERE `reference_id` = 1 and `for` = 'ibu'