app/Http/Controllers/OrangtuaWaliController.php

    public function createortu(Request $request)
    {
        // dd($request->all());
        $bio = Biodata::find(auth()->user()->bio->id);
        $ayah = [
                'biodata_id'       => $request->biodata_id1,
                'role'             => $request->role1,
                'name'             => $request->name1,
                'birthday'         => $request->birthday1,
                'religion'         => $request->religion1,
                'profession'       => $request->profession1,
                'phone'            => $request->phone1
       ];
        $ibu = [
                'biodata_id'       => $request->biodata_id2,
                'role'             => $request->role2,
                'name'             => $request->name2,
                'birthday'         => $request->birthday2,
                'religion'         => $request->religion2,
                'profession'       => $request->profession2,
                'phone'            => $request->phone2
               ];

        $bio->orangtua()->createMany([$ayah,$ibu]);
        $ortu = DataOrangTua::where('biodata_id',auth()->user()->bio->id)->first();
---
SELECT * FROM `biodatas` WHERE `biodatas`.`user_id` = 1 and `biodatas`.`user_id` IS not NULL LIMIT 1
INSERT INTO `data_orang_tuas` (`biodata_id`, `role`, `name`, `birthday`, `religion`, `profession`, `phone`, `updated_at`, `created_at`) VALUES (1, 'Ayah', 'Nicolas', '2011-12-12', 'Katolik', 'Pilot', '081237012312', '2022-09-19 06:22:03', '2022-09-19 06:22:03')
SELECT * FROM `data_orang_tuas` WHERE `biodata_id` = 1 LIMIT 1

                       'provinsi'  => $request->provinsi2,
                       'kodepos'   => $request->kodepos2
                       ];
        $ortu->alamat()->createMany([$alamatAyah,$alamatIbu]);
---
INSERT INTO `alamats` (`alamat`, `for`, `kecamatan`, `kabupaten`, `provinsi`, `kodepos`, `reference_id`, `updated_at`, `created_at`) VALUES ('Kuil Deket Gereja', 'ayah', 'Legok', 'Tangerang', 'Banten', '15820', 1, '2022-09-19 06:22:03', '2022-09-19 06:22:03')

                 'profession'   => $request->profession3,
                 'phone'        => $request->phone3
                ];
        $bio->walilain()->create($wali);
        $wali = WaliLain::where('biodata_id',auth()->user()->bio->id)->first();
---
INSERT INTO `wali_lains` (`biodata_id`, `role`, `nik`, `name`, `birthplace`, `birthday`, `religion`, `profession`, `phone`, `updated_at`, `created_at`) VALUES (1, , , , , , , , , '2022-09-19 06:22:03', '2022-09-19 06:22:03')
SELECT * FROM `wali_lains` WHERE `biodata_id` = 1 LIMIT 1

                       'provinsi'  => $request->provinsi3,
                       'kodepos'   => $request->kodepos3
                      ];
        $wali->alamat()->create($alamatWali);
---
INSERT INTO `alamats` (`alamat`, `for`, `kecamatan`, `kabupaten`, `provinsi`, `kodepos`, `reference_id`, `updated_at`, `created_at`) VALUES (, 'wali', , , , , 1, '2022-09-19 06:22:03', '2022-09-19 06:22:03')

    public function profilwali()
    {
        try{
        $ayah = DataOrangTua::where('biodata_id',auth()->user()->bio->id)
                            ->where('role','ayah')
                            ->firstOrFail();
        $ibu = DataOrangTua::where('biodata_id',auth()->user()->bio->id)
                            ->where('role','ibu')
                            ->firstOrFail();
        $wali = WaliLain::where('biodata_id',auth()->user()->bio->id)
                        ->first();
        $alamatAyah = Alamat::where([['reference_id',auth()->user()->bio->id],['for','ayah']])
                            ->first();
        $alamatIbu = Alamat::where([['reference_id',auth()->user()->bio->id],['for','ibu']])
                            ->first();
        $alamatWali = Alamat::where([['reference_id',auth()->user()->bio->id],['for','wali']])
                            ->first();
---
SELECT * FROM `data_orang_tuas` WHERE `biodata_id` = 1 and `role` = 'ayah' LIMIT 1
SELECT * FROM `data_orang_tuas` WHERE `biodata_id` = 5 and `role` = 'ayah' LIMIT 1
SELECT * FROM `wali_lains` WHERE `biodata_id` = 1 LIMIT 1
SELECT * FROM `alamats` WHERE (`reference_id` = 1 and `for` = 'ayah') LIMIT 1
SELECT * FROM `alamats` WHERE (`reference_id` = 5 and `for` = 'ayah') LIMIT 1
SELECT * FROM `alamats` WHERE (`reference_id` = 1 and `for` = 'wali') LIMIT 1

    public function updatewali(Request $request){
        $wali = ['biodata_id'   => auth()->user()->bio->id,
                 'role'         => $request->role3,
                 'nik'          => $request->nik3,
                 'name'         => $request->name3,
                 'birthplace'   => $request->birthplace3,
                 'birthday'     => $request->birthday3,
                 'religion'     => $request->religion3,
                 'profession'   => $request->profession3,
                 'phone'        => $request->phone3
                ];
    $alamatWali = ['alamat' => $request->alamat3,
                'for'           => $request->for3,
                'kecamatan'     => $request->kecamatan3,
                'kabupaten'     => $request->kabupaten3,
                'provinsi'      => $request->provinsi3,
                'kodepos'       => $request->kodepos3
               ];
        WaliLain::where('biodata_id',auth()->user()->bio->id)
                ->update($wali);
        Alamat::where('reference_id',auth()->user()->bio->id)
               ->where('for','wali')
               ->update($alamatWali);
---
UPDATE `wali_lains` SET `biodata_id` = 1, `role` = 'Paman', `nik` = '2132141231221', `name` = , `birthplace` = , `birthday` = , `religion` = , `profession` = , `phone` = , `wali_lains`.`updated_at` = '2022-09-19 06:58:28' WHERE `biodata_id` = 1
UPDATE `alamats` SET `alamat` = , `for` = 'wali', `kecamatan` = , `kabupaten` = , `provinsi` = , `kodepos` = , `alamats`.`updated_at` = '2022-09-19 06:58:28' WHERE `reference_id` = 1 and `for` = 'wali'