app/Http/Controllers/RegisterController.php

    public function createAccount(Request $request){
        $validatedData = $request->validate([
            "role" => "required",
            "username" => "required|min:5",
            "email" => "required|email:dns",
            "password" => "required|min:8",
        ]);
        $validatedData['password'] = bcrypt($validatedData['password']);
        User::create($validatedData);
---
INSERT INTO `users` (`role`, `username`, `email`, `password`, `updated_at`, `created_at`) VALUES ('siswa', 'contoh2', 'contoh@gmail.com', '$2y$10$PxHglhTfEdEYgoQsouhO3.QI3WgoCQn1GOe/07m4toiIRGk1OrkZG', '2022-09-16 06:44:00', '2022-09-16 06:44:00')